--
-- Created by IntelliJ IDEA.
-- User: Administrator
-- Date: 2015/1/31
-- Time: 19:10
-- To change this template use File | Settings | File Templates.
--
--[[
monsterConfig = {
    {[id] = value,[src] = value,[animation]={},[hp]={},[speed]=value,[size]=value,[wayPoint]={{}}}
}
]]
--playType 玩法
--freeGo 是 随机几个wayPoint  逐一到达后 最后到达终点   为nil 则 直接用后面的wayPoint
--harmSmall 怪物受到伤害后逐渐体型变小
--fadeIn   怪物进入隐身状态  之后 现形
src = {[1] = {1,2,3,4}, [2] = {1,2,3,4}, [3]= {1,2,3,4,5,6}, [4] = {1,2,3,4}, [5] = {1,2,3,4}, [6] = {1,2,3,4}, [7] = {1,2,3,4,5,6}, [8] = {1,2,3}}
monsterConfig = {
    --五星瓢虫
    --hp 60, speed 0.6 scale 0.8  playType nil
    {["id"] = 5001, ["src"] = 1, ["animation"] = src[1], ["power"] = 10, ["hp"] = {60}, ["speed"] = 1, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    {["id"] = 5002, ["src"] = 3, ["animation"] = src[3], ["power"] = 20, ["hp"] = {140}, ["speed"] = 1, ["scale"] = 2, ["size"]={140, 140}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 140, speed 0.7 scale 1.6  playType nil
    {["id"] = 5003, ["src"] = 1, ["animation"] = src[1], ["power"] = 20, ["hp"] = {140}, ["speed"] = 0.9, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 20, speed 2.8 scale 0.8  playType freeGo
    {["id"] = 5004, ["src"] = 1, ["animation"] = src[1], ["power"] = 11, ["hp"] = {20}, ["speed"] = 3.4, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {["freeGo"] = 4}, ["wayPoint"]={{640, 360}}},
    --hp 60, speed 0.6 scale 0.4  playType nil
    {["id"] = 5005, ["src"] = 1, ["animation"] = src[1], ["power"] = 11, ["hp"] = {60}, ["speed"] = 0.8, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 60, speed 0.6 scale 0.4  playType freeGo
    {["id"] = 5006, ["src"] = 1, ["animation"] = src[1], ["power"] = 11, ["hp"] = {60}, ["speed"] = 0.8, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3}, ["wayPoint"]={{640, 360}}},
    --hp 200, speed 0.8 scale 1.6  playType harmSmall
    {["id"] = 5007, ["src"] = 1, ["animation"] = src[1], ["power"] = 20, ["hp"] = {200}, ["speed"] = 1, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {["harmSmall"] = 1}, ["wayPoint"]={{640, 360}}},
    --hp 60, speed 3 scale 0.4  playType freeGo，fadeIn
    {["id"] = 5008, ["src"] = 1, ["animation"] = src[1], ["power"] = 11, ["hp"] = {60}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3, ["fadeIn"] = 1}, ["wayPoint"]={{640, 360}}},

    --蟑螂
    --hp 70, speed 0.7 scale 0.8  playType nil
    {["id"] = 5011, ["src"] = 2, ["animation"] = src[2], ["power"] = 11, ["hp"] = {70}, ["speed"] = 1.1, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 180, speed 0.8 scale 1.6  playType nil
    {["id"] = 5012, ["src"] = 2, ["animation"] = src[2], ["power"] = 20, ["hp"] = {180}, ["speed"] = 1, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 30, speed 2.9 scale 0.8  playType freeGo
    {["id"] = 5013, ["src"] = 2, ["animation"] = src[2], ["power"] = 12, ["hp"] = {30}, ["speed"] = 3.4, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {["freeGo"] = 4}, ["wayPoint"]={{640, 360}}},
    --hp 70, speed 0.7 scale 0.4  playType nil
    {["id"] = 5014, ["src"] = 2, ["animation"] = src[2], ["power"] = 12, ["hp"] = {70}, ["speed"] = 0.9, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 70, speed 0.7 scale 0.4  playType freeGo
    {["id"] = 5015, ["src"] = 2, ["animation"] = src[2], ["power"] = 12, ["hp"] = {70}, ["speed"] = 0.9, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3}, ["wayPoint"]={{640, 360}}},
    --hp 180, speed 0.8 scale 1.6  playType harmSmall
    {["id"] = 5016, ["src"] = 2, ["animation"] = src[2], ["power"] = 20, ["hp"] = {210}, ["speed"] = 1, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {["harmSmall"] = 1}, ["wayPoint"]={{640, 360}}},
    --hp 70, speed 3 scale 0.4  playType freeGo fadeIn
    {["id"] = 5017, ["src"] = 2, ["animation"] = src[2], ["power"] = 12, ["hp"] = {70}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3, ["fadeIn"] = 1}, ["wayPoint"]={{640, 360}}},

    --铁甲虫
    --hp 80, speed 0.7 scale 0.8  playType nil
    {["id"] = 5021, ["src"] = 3, ["animation"] = src[3], ["power"] = 12, ["hp"] = {80}, ["speed"] = 1.1, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 200, speed 0.8 scale 1.6  playType nil
    {["id"] = 5022, ["src"] = 3, ["animation"] = src[3], ["power"] = 22, ["hp"] = {200}, ["speed"] = 1, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 40, speed 3 scale 0.8  playType freeGo
    {["id"] = 5023, ["src"] = 3, ["animation"] = src[3], ["power"] = 13, ["hp"] = {40}, ["speed"] = 3.4, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {["freeGo"] = 4},["wayPoint"]={{640, 360}}},
    --hp 80, speed 0.9 scale 0.4  playType nil
    {["id"] = 5024, ["src"] = 3, ["animation"] = src[3], ["power"] = 13, ["hp"] = {80}, ["speed"] = 0.9, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {},["wayPoint"]={{640, 360}}},
    --hp 80, speed 0.9 scale 0.4  playType freeGo
    {["id"] = 5025, ["src"] = 3, ["animation"] = src[3], ["power"] = 13, ["hp"] = {80}, ["speed"] = 0.9, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3},["wayPoint"]={{640, 360}}},
    --hp 240, speed 0.8 scale 1.6  playType harmSmall
    {["id"] = 5026, ["src"] = 3, ["animation"] = src[3], ["power"] = 22, ["hp"] = {220}, ["speed"] = 1, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {["harmSmall"] = 1}, ["wayPoint"]={{640, 360}}},
    --hp 80, speed 3 scale 0.4  playType freeGo fadeIn
    {["id"] = 5027, ["src"] = 3, ["animation"] = src[3], ["power"] = 13, ["hp"] = {80}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3, ["fadeIn"] = 1},["wayPoint"]={{640, 360}}},

    --毒蜂
    --hp 80, speed 0.9 scale 0.8  playType nil
    {["id"] = 5031, ["src"] = 4, ["animation"] = src[4], ["power"] = 13, ["hp"] = {80}, ["speed"] = 1.2, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 180, speed 1 scale 1.6  playType nil
    {["id"] = 5032, ["src"] = 4, ["animation"] = src[4], ["power"] = 20, ["hp"] = {180}, ["speed"] = 1.1, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 50, speed 3 scale 0.8  playType freeGo
    {["id"] = 5033, ["src"] = 4, ["animation"] = src[4], ["power"] = 14, ["hp"] = {50}, ["speed"] = 3.4, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {["freeGo"] = 4},["wayPoint"]={{640, 360}}},
    --hp 80, speed 0.9 scale 0.4  playType nil
    {["id"] = 5034, ["src"] = 4, ["animation"] = src[4], ["power"] = 14, ["hp"] = {80}, ["speed"] = 0.9, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {},["wayPoint"]={{640, 360}}},
    --hp 80, speed 3 scale 0.4  playType freeGo
    {["id"] = 5035, ["src"] = 4, ["animation"] = src[4], ["power"] = 14, ["hp"] = {90}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3},["wayPoint"]={{640, 360}}},
    --hp 80, speed 3 scale 0.4  playType freeGo fadeIn
    {["id"] = 5036, ["src"] = 4, ["animation"] = src[4], ["power"] = 14, ["hp"] = {80}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3, ["fadeIn"] = 1},["wayPoint"]={{640, 360}}},
    --hp 260, speed 1 scale 1.6  playType harmSmall
    {["id"] = 5037, ["src"] = 4, ["animation"] = src[4], ["power"] = 20, ["hp"] = {230}, ["speed"] = 1.2, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {["harmSmall"] = 1}, ["wayPoint"]={{640, 360}}},
    --hp 80, speed 3 scale 0.4  playType freeGo fadeIn
    {["id"] = 5038, ["src"] = 4, ["animation"] = src[4], ["power"] = 14, ["hp"] = {90}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3, ["fadeIn"] = 1},["wayPoint"]={{640, 360}}},

    --臭屁虫
    --hp 90, speed 0.8 scale 0.8  playType nil
    {["id"] = 5041, ["src"] = 5, ["animation"] = src[5], ["power"] = 13, ["hp"] = {90}, ["speed"] = 1.2, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 200, speed 1 scale 1.6  playType nil
    {["id"] = 5042, ["src"] = 5, ["animation"] = src[5], ["power"] = 20, ["hp"] = {200}, ["speed"] = 1.2, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 90, speed 0.8 scale 0.4  playType nil
    {["id"] = 5043, ["src"] = 5, ["animation"] = src[5], ["power"] = 13, ["hp"] = {90}, ["speed"] = 0.9, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 90, speed 3 scale 0.4  playType freeGo
    {["id"] = 5044, ["src"] = 5, ["animation"] = src[5], ["power"] = 13, ["hp"] = {100}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3}, ["wayPoint"]={{640, 360}}},
    --hp 280, speed 1.6 scale 1.6  playType harmSmall
    {["id"] = 5045, ["src"] = 5, ["animation"] = src[5], ["power"] = 20, ["hp"] = {240}, ["speed"] = 1.2, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {["harmSmall"] = 1}, ["wayPoint"]={{640, 360}}},
    --hp 100, speed 3 scale 0.4  playType freeGo fadeIn
    {["id"] = 5046, ["src"] = 5, ["animation"] = src[5], ["power"] = 13, ["hp"] = {100}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3, ["fadeIn"] = 1}, ["wayPoint"]={{640, 360}}},

    --金甲虫
    --hp 100, speed 0.8 scale 0.8  playType nil
    {["id"] = 5051, ["src"] = 6, ["animation"] = src[6], ["power"] = 14, ["hp"] = {100}, ["speed"] = 1.2, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 280, speed 1 scale 1.6  playType nil
    {["id"] = 5052, ["src"] = 6, ["animation"] = src[6], ["power"] = 22, ["hp"] = {280}, ["speed"] = 1.2, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 100, speed 3 scale 0.4  playType freeGo
    {["id"] = 5053, ["src"] = 6, ["animation"] = src[6], ["power"] = 14, ["hp"] = {110}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={70, 70}, ["playType"] = {["freeGo"] = 1}, ["wayPoint"]={{640, 360}}},
    --hp 280, speed 1 scale 1.6  playType harmSmall
    {["id"] = 5054, ["src"] = 6, ["animation"] = src[6], ["power"] = 22, ["hp"] = {250}, ["speed"] = 1.2, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {["harmSmall"] = 1}, ["wayPoint"]={{640, 360}}},
    --hp 100, speed 3 scale 0.4  playType freeGo fadeIn
    {["id"] = 5056, ["src"] = 6, ["animation"] = src[6], ["power"] = 14, ["hp"] = {110}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3, ["fadeIn"] = 1}, ["wayPoint"]={{640, 360}}},

    --蝴蝶
    --hp 110, speed 0.8 scale 0.8  playType nil
    {["id"] = 5061, ["src"] = 7, ["animation"] = src[7], ["power"] = 14, ["hp"] = {110}, ["speed"] = 1.2, ["scale"] = 1, ["size"]={70, 70}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 220, speed 0.9 scale 1.6  playType harmSmall
    {["id"] = 5062, ["src"] = 7, ["animation"] = src[7], ["power"] = 22, ["hp"] = {260}, ["speed"] = 1.1, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {["harmSmall"] = 1}, ["wayPoint"]={{640, 360}}},
    --hp 120, speed 3 scale 0.4  playType freeGo fadeIn
    {["id"] = 5063, ["src"] = 7, ["animation"] = src[7], ["power"] = 14, ["hp"] = {120}, ["speed"] = 3, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3, ["fadeIn"] = 1}, ["wayPoint"]={{640, 360}}},

    --苍蝇
    --hp 80, speed 3 scale 0.8  playType freeGo
    {["id"] = 5071, ["src"] = 8, ["animation"] = src[8], ["power"] = 12, ["hp"] = {90}, ["speed"] = 3.2, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {["freeGo"] = 4},["wayPoint"]={{640, 360}}},
    --hp 200, speed 0.7 scale 1.6  playType nil
    {["id"] = 5072, ["src"] = 8, ["animation"] = src[8], ["power"] = 20, ["hp"] = {200}, ["speed"] = 1, ["scale"] = 1.6, ["size"]={140, 140}, ["playType"] = {}, ["wayPoint"]={{640, 360}}},
    --hp 40, speed 3 scale 0.8  playType freeGo
    {["id"] = 5073, ["src"] = 8, ["animation"] = src[8], ["power"] = 12, ["hp"] = {70}, ["speed"] = 3.4, ["scale"] = 0.8, ["size"]={70, 70}, ["playType"] = {["freeGo"] = 4},["wayPoint"]={{640, 360}}},
    --hp 80, speed 0.9 scale 0.4  playType nil
    {["id"] = 5074, ["src"] = 8, ["animation"] = src[8], ["power"] = 12, ["hp"] = {90}, ["speed"] = 0.9, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {},["wayPoint"]={{640, 360}}},
    --hp 80, speed 0.9 scale 0.4  playType freeGo
    {["id"] = 5075, ["src"] = 8, ["animation"] = src[8], ["power"] = 12, ["hp"] = {90}, ["speed"] = 0.9, ["scale"] = 0.4, ["size"]={35, 35}, ["playType"] = {["freeGo"] = 3},["wayPoint"]={{640, 360}}},
}







--[[
flyConfig = {
    {[id] = value,[src] = value,[size] = {}, }  --切记 size和图片width height 相反（经验之谈）
}
 ]]
flyConfig = {
    {["id"] = 1, ["src"] = 1, ["animation"] = {}, ["size"] = {40, 40}, ["speed"] = 6},   --玉米 远程攻击                  --远程
    {["id"] = 2, ["src"] = 0, ["animation"] = {}, ["size"] = {100, 120}, ["speed"] = 0},  --heroID 1 近程攻击                   --近战
    {["id"] = 3, ["src"] = 0, ["animation"] = {}, ["size"] = {1280, 720}, ["speed"] = 0},              --sf 大招
    --{["id"] = 4, ["src"] = 0, ["animation"] = {}, ["size"] = {100, 100}, ["speed"] = 0},
    {["id"] = 5, ["src"] = 0, ["animation"] = {6,7,8,9}, ["size"] = {150, 150}, ["speed"] = 0,},-- 子弹产生的爆炸
    {["id"] = 6, ["src"] = 0, ["animation"] = {30,31,32,33,34,35,36,37,38,39,40,41}, ["size"] = {180, 100}, ["speed"] = 0,},-- 死亡阴影
    {["id"] = 7, ["src"] = 0, ["animation"] = {20,21,22}, ["size"] = {30, 640}, ["speed"] = 0,}, --闪电普攻            --闪电普攻
    {["id"] = 8, ["src"] = 0, ["animation"] = {}, ["size"] = {80, 640}, ["speed"] = 0,},             --闪电大招
    {["id"] = 9, ["src"] = 9, ["animation"] = {}, ["size"] = {40, 40}, ["speed"] = 6},   --茄子 远程攻击
    {["id"] = 10, ["src"] = 10, ["animation"] = {}, ["size"] = {40, 40}, ["speed"] = 6},   --辣椒 远程攻击
    {["id"] = 11, ["src"] = 0, ["animation"] = {}, ["size"] = {300, 300}, ["speed"] = 0, ["buff_id"] = 50001},             --死亡飞轮
    {["id"] = 12, ["src"] = 0, ["animation"] = {}, ["size"] = {150, 150}, ["speed"] = 0,},             --雷霆万均
}






solderConfig = {
    -- ["fightCloseWord"]
    {["id"] = 1, ["src"] = 1, ["openStar"] = 0, ["price"] = 0, ["animation"]={}, ["hpCount"]=4, ["attack"] = 22, ["fight"] = 60, ["size"] = {100, 100}, ["describe"] = "一只可爱的普通玉米，但不畏敌人，为了家园勇敢的加入了战争"},
    {["id"] = 2, ["src"] = 1, ["openStar"] = 18, ["price"] = 1000, ["animation"]={}, ["hpCount"]=4, ["attack"] = 22, ["fight"] = 70, ["size"] = {100, 100}, ["describe"] = "一只变异的玉米，能一次性发出3发子弹，是玉米界的战斗新星"},
    {["id"] = 3, ["src"] = 1, ["openStar"] = 36, ["price"] = 2000, ["animation"]={}, ["hpCount"]=5, ["attack"] = 24, ["fight"] = 70, ["size"] = {100, 100}, ["describe"] = "一只暴躁的玉米，但只是针对敌人，爆炸是它的艺术和追求"},
    {["id"] = 4, ["src"] = 1, ["openStar"] = 10000, ["price"] = 200000000, ["animation"]={}, ["hpCount"]=6, ["attack"] = 28, ["fight"] = 90, ["size"] = {100, 100}, ["describe"] = "魔玉，为保卫家园习得上古魔咒，终成魔王玉米，敌人看到它只会无尽的颤抖..."},
    {["id"] = 5, ["src"] = 1, ["openStar"] = 10000, ["price"] = 200000000, ["animation"]={}, ["hpCount"]=7, ["attack"] = 30, ["fight"] = 100, ["size"] = {100, 100}, ["describe"] = "闪电玉米，因一次意外雷击使它拥有恐怖的雷击，敌人还没看到它已然变为焦土"},
}






--备注  skillID = solderId * 1000 + 1  leadTime 施法前摇 effectTime 特效时长   space 当出现多个fly时 时间间隔创建特效和子弹
skillConfig = {
    {["id"] = 1001, ["flyId"] = 1, ["harm"] = 25, ["count"] = 1, ["cd"] = 0, ["leadTime"] = 0.18, ["effectTime"] = 0, ["cost"] = 2},   --远程
    {["id"] = 1002, ["flyId"] = 2, ["harm"] = 25, ["count"] = 1, ["cd"] = 0, ["leadTime"] = 0.2, ["effectTime"] = 0},   --近战
    {["id"] = 1003, ["flyId"] = 1, ["harm"] = 16, ["count"] = 1, ["cd"] = 100, ["leadTime"] = 0.2,--横扫四方
        ["skillAnimation"] = {}, ["effectTime"] = 6,["effectAnimation"]={}, ["space"]=0.1, ["skillDescribe"] = "横扫四方"},



    {["id"] = 2001, ["flyId"] = 9, ["harm"] = 25, ["count"] = 3, ["cd"] = 0, ["leadTime"] = 0.26, ["effectTime"] = 0, ["cost"] = 2},   --远程
    {["id"] = 2002, ["flyId"] = 2, ["harm"] = 25, ["count"] = 1, ["cd"] = 0, ["leadTime"] = 0.1, ["effectTime"] = 0},   --近程
    {["id"] = 2003, ["flyId"] = 9, ["harm"] = 17, ["count"] = 8, ["cd"] = 100, ["leadTime"] = 0.2,--疯狂扫射
        ["skillAnimation"] = {}, ["effectTime"] = 2,["effectAnimation"]={}, ["space"]=0.25, ["skillDescribe"] = "疯狂扫射"},




    {["id"] = 3001, ["flyId"] = 10, ["ramificationFlyId"] = 5, ["harm"] = 30, ["count"] = 1, ["cd"] = 0, ["leadTime"] = 0.22, ["effectTime"] = 0, ["ramificationTime"] = 0.2, ["cost"] = 3},   --远程   碰撞产生爆炸
    {["id"] = 3002, ["flyId"] = 2, ["harm"] = 30, ["count"] = 1, ["cd"] = 0, ["leadTime"] = 0.2, ["effectTime"] = 0},   --近程
    {["id"] = 3003, ["flyId"] = 5, ["harm"] = 50, ["count"] = 45, ["cd"] = 100, ["leadTime"] = 0.2, --天降土豆
        ["skillAnimation"] = {2,3,4,5,6,2,1}, ["effectTime"] = 0.6,["effectAnimation"]={6,7,8,9}, ["space"]=0.05,["buff_id"] =50004, ["skillDescribe"] = "召唤土豆君",},




    {["id"] = 4001, ["flyId"] = 6, ["harm"] = 65, ["count"] = 1, ["cd"] = 0, ["leadTime"] = 0.3, ["effectTime"] = 0.3, ["effectAnimation"]={}, ["cost"] = 3},   --远程   死亡阴影
    {["id"] = 4002, ["flyId"] = 2, ["harm"] = 65, ["count"] = 1, ["cd"] = 0, ["leadTime"] = 0.2, ["effectTime"] = 0},   --近程
    {["id"] = 4003, ["flyId"] = 3, ["harm"] = {160, 120, 80, 60}, ["count"] = 1, ["cd"] = 100, ["leadTime"] = 0.2,--sf 大招
        ["skillAnimation"] = {}, ["effectTime"] = 1,["effectAnimation"]={50,51,52,53,54,55,56,57,58,59,60}, ["space"]=0, ["skillDescribe"] = "魂之挽歌"},




    {["id"] = 5001, ["flyId"] = 7, ["harm"] = 65, ["count"] = 1, ["cd"] = 0, ["leadTime"] = 0.3, ["effectTime"] = 0.3, ["effectAnimation"]={}, ["cost"] = 3},   --远程  激光
    {["id"] = 5002, ["flyId"] = 2, ["harm"] = 65, ["count"] = 1, ["cd"] = 0, ["leadTime"] = 0.2, ["effectTime"] = 0},   --近程
    {["id"] = 5003, ["flyId"] = 8, ["harm"] = 24, ["count"] = 60, ["cd"] = 100, ["leadTime"] = 0.2,--死亡激光
        ["skillAnimation"] = {}, ["effectTime"] = 6,["effectAnimation"]={24, 25, 26, 24}, ["space"]=0.1, ["skillDescribe"] = "死亡激光"},


    {["id"] = 6003, ["flyId"] = 11, ["harm"] = 10, ["count"] = 50, ["cd"] = 100, ["leadTime"] = 0.2,--死亡飞轮
        ["skillAnimation"] = {}, ["effectTime"] = 5,["effectAnimation"]={}, ["space"]=0.1, ["skillDescribe"] = "死亡飞轮"},

    {["id"] = 7003, ["flyId"] = 12, ["harm"] = 140, ["count"] = 0, ["cd"] = 100, ["leadTime"] = 0.2,--雷霆万均
        ["skillAnimation"] = {}, ["effectTime"] = 0.5,["effectAnimation"]={70,71,72,73,74,75,76,77,78,79,80,81,82}, ["space"]=0, ["skillDescribe"] = "雷霆万均"},

}



--type 两种类型，skill，技能里面也可能自带buff           buff则只添加buff ，
propConfig = {
    {["id"] = 10001, ["type"] = "skill", ["skillId"] = 0, ["buffId"] = 0,},
    {["id"] = 10002, ["type"] = "skill", ["skillId"] = 6003, ["buffId"] = 0,},
    {["id"] = 10003, ["type"] = "skill", ["skillId"] = 7003, ["buffId"] = 0,},
    {["id"] = 10004, ["type"] = "buff", ["skillId"] = 0, ["buffId"] = 50002,},
    {["id"] = 10005, ["type"] = "buff", ["skillId"] = 0, ["buffId"] = 50003,},
}


--buff 如果是针对技能的话  最好放在子弹上面   如果是针对prop增加buff则直接放到prop里面
--type 两种类型， 一个hero， 一个monster，
buffConfig = {
    {["id"] = 50001, ["host"] = "monster", ["during"] = 3, ["gain"] = {["type"] = "speed", ["param"] = 0.5}},--减速
    {["id"] = 50002, ["host"] = "hero", ["during"] = 10, ["gain"] = {["type"] = "attack", ["param"] = 2}},
    {["id"] = 50003, ["host"] = "hero", ["during"] = 10, ["gain"] = {["type"] = "attack_speed", ["param"] = 2},["effectAnimation"] = {90,91,92,93,94}},
    {["id"] = 50004, ["host"] = "hero", ["during"] = 3, ["gain"] = {["type"] = "invincible"}},
}










--[[
chapterConfig = {
    [1] = {
        {[delay] = value, [monsterList] = {{delay, count, monsterId}, {delay, count, monsterId}}}
        {[delay] = value, [monsterList] = {{delay, count, monsterId}, {delay, count, monsterId}}}
    }
    [2] = {
    }
}
小怪
1、围攻类型，所有怪物出来的时间很近       （简单  给能量快  ）
2、挨个延时出现 所有怪物延时时间比较长    （相对1难些 能量慢）

大怪
1、围攻类型 所有怪物出来的时间很近        （难，相对而言 这个比较是最难的 大怪的血量高  ）
2、挨个延时出现 所有怪物延时时间比较长     （相对1比较简单些， 玩家挨个打就是了）

姑且先将怪物分为 A、B、C、D、E、F、G、H  血量 速度  待定


设计关卡规则   第一波 给能量  第二波 出大怪  第三波 大怪和 小怪 一起出 ，同时根据实际情况 来给定难度 是围攻还是挨个
-- ]]


chapterConfig = {
    --第一章
    [1] = {    --monsterId 1, 2, 3
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 2, 5001},{5, 2, 5001},{8, 2, 5001},{12, 1, 5001}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001}, {3, 2, 5001}, {9, 1, 5002}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5001},{3, 3, 5001},{8, 2, 5001},{13, 4, 5001},{19, 2, 5003}}},
    },

    [2] = {      --monsterId 1, 3, 4
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 2, 5001},{5, 2, 5001},{8, 3, 5002},{12, 5, 5001}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 1, 5003}, {4, 1, 5003}, {8, 1, 5003}, {12, 1, 5003}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 4, 5001},{8, 1, 5003},{12, 3, 5011},{17, 2, 5003}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 4, 5001},{8, 4, 5034},{12, 3, 5011},{17, 2, 5003}}},
    },

    [3] = {  --monsterId 1, 3, 4
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 2, 5001},{5, 2, 5001},{8, 2, 5001},{12, 5, 5011}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 1, 5003}, {4, 1, 5003}, {8, 1, 5003}, {12, 2, 5003}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 4, 5011},{8, 1, 5003},{12, 3, 5011},{17, 3, 5003}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 4, 5071},{8, 1, 5003},{10, 4, 5071},{12, 3, 5011},{17, 3, 5003}}},
    },

    [4] = {  --monsterId 1, 3, 4, 5
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 2, 5001},{5, 2, 5011},{8, 2, 5001},{12, 5, 5011}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 1, 5003}, {4, 2, 5003}, {8, 1, 5003}, {13, 2, 5012}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 4, 5011},{8, 2, 5003},{12, 3, 5011},{16, 2, 5061},{20, 5, 5012}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 4, 5011},{8, 6, 5046},{12, 3, 5011},{16, 3, 5012},{20, 1, 5052}}},
    },

    --[[
        [2] = {      --monsterId 1, 3, 4
            {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 2, 5001},{5, 2, 5001},{8, 2, 5001},{12, 5, 5001}}},
            {["delay"] = 2 , ["monsterList"]={{0.5, 1, 5003}, {4, 1, 5003}, {8, 1, 5003}, {12, 1, 5003}}},
            {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 4, 5001},{8, 1, 5003},{12, 3, 5011},{17, 2, 5003}}},
        },

        [3] = {  --monsterId 1, 3, 4
            {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 2, 5001},{5, 2, 5001},{8, 2, 5001},{12, 5, 5011}}},
            {["delay"] = 2 , ["monsterList"]={{0.5, 1, 5003}, {4, 1, 5003}, {8, 1, 5003}, {12, 2, 5003}}},
            {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 4, 5011},{8, 1, 5003},{12, 3, 5011},{17, 3, 5003}}},
        },

        [4] = {  --monsterId 1, 3, 4, 5
            {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 2, 5001},{5, 2, 5011},{8, 2, 5001},{12, 5, 5011}}},
            {["delay"] = 2 , ["monsterList"]={{0.5, 1, 5003}, {4, 2, 5003}, {8, 1, 5003}, {13, 2, 5012}}},
            {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 4, 5011},{8, 2, 5003},{12, 3, 5011},{16, 2, 5061},{20, 5, 5012}}},
        },
    ]]
    [5] = { --monsterId 1, 3, 4, 5
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 2, 5001},{5, 2, 5011},{8, 2, 5001},{12, 5, 5011}, {13, 1, 5012}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 1, 5003}, {4, 2, 5003}, {8, 1, 5003}, {13, 2, 5012}},{20, 3, 5012}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 8, 5001},{4, 7, 5011},{8, 4, 5003},{12, 8, 5011},{16, 5, 5061},{20, 3, 5012},{24, 5, 5011},{28, 3, 5012}}},
    },

    [6] = {  --monsterId 1, 3, 4, 5
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 5, 5001},{8, 6, 5001}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5003},{4, 2, 5003},{8, 2, 5003}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5011},{4, 5, 5011},{8, 6, 5011}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5012},{6, 2, 5012},{12, 2, 5012}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 5, 5001},{4, 5, 5011},{8, 2, 5003},{12, 5, 5011},{20, 3, 5012},{24, 5, 5011},{28, 3, 5012},{33, 2, 5062}, {35, 2, 5022}}},
    },

    --第二章
    [7] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 3, 5001},{5, 6, 5001},{10, 2, 5021},{14, 2, 5021}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5073},{2, 2, 5073},{5, 2, 5073},{8, 2, 5073},{12, 1, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5001},{3, 3, 5001},{8, 2, 5001},{13, 2, 5073},{19, 2, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5001},{3, 2, 5073},{7, 3, 5001},{11, 2, 5021},{15, 2, 5073},{19, 4, 5022}}},
    },

    [8] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 3, 5001},{5, 6, 5011},{10, 3, 5021},{14, 3, 5021}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5073},{2, 2, 5073},{5, 3, 5073},{8, 3, 5073},{12, 3, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5011},{3, 3, 5011},{8, 3, 5021},{13, 3, 5073},{19, 3, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5001},{3, 4, 5073},{7, 3, 5011},{11, 3, 5021},{15, 4, 5073},{19, 5, 5022}}},
    },


    [9] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5001},{2, 3, 5001},{5, 6, 5011},{10, 3, 5021},{14, 2, 5022}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5022},{2, 4, 5073},{5, 4, 5073},{8, 4, 5073},{12, 4, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5022},{4, 5, 5073},{8, 5, 5021},{13, 5, 5073},{19, 5, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5022},{3, 10, 5073},{8, 5, 5021},{7, 10, 5073}}},
    },

    [10] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5003},{2, 6, 5001},{5, 4, 5031},{8, 3, 5012},{12, 6, 5011},{14, 4, 5031}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5003},{5, 3, 5012},{10, 4, 5022},{15, 6, 5031}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 8, 5031},{6, 4, 5022},{9, 8, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 6, 5031},{4, 4, 5003},{8, 4, 5073},{12, 4, 5012},{16, 4, 5073},{20, 4, 5022},{24, 6, 5031},{28, 4, 5073},{32, 4, 5032},{32, 1, 5054}}},
    },

    [11] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5003},{4, 6, 5001},{9, 10, 5004}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5012},{4, 6, 5011},{9, 10, 5013}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5022},{4, 6, 5021},{9, 10, 5023}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5032},{4, 6, 5031},{9, 10, 5033}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 10, 5004},{6, 10, 5013},{12, 10, 5023},{18, 10, 5033},{24, 20, 5073}, {24, 2, 5054}}},
    },

    [12] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5003},{2, 6, 5001},{5, 4, 5031},{8, 3, 5012},{12, 6, 5011},{14, 4, 5031}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5003},{5, 3, 5012},{10, 4, 5022},{15, 6, 5031}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 8, 5031},{6, 4, 5022},{9, 8, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 6, 5031},{4, 4, 5003},{8, 4, 5073},{12, 4, 5012},{16, 4, 5073},{20, 4, 5022},{24, 6, 5031},{28, 4, 5073},{32, 4, 5032},{36, 4, 5054}}},
    },

    [13] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5011},{4, 3, 5012},{8, 2, 5024},{12, 2, 5024},{16, 3, 5024}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5012},{4, 2, 5024},{8, 3, 5012},{12, 3, 5024},{16, 2, 2022}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5022},{4, 3, 5024},{8, 2, 5024},{12, 2, 5022},{13, 2, 5032},{16, 2, 5034}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5022},{6, 3, 5024},{12, 3, 5024},{18, 1, 5052},{24, 2, 5034},{16, 4, 5024}}}
    },

    [14] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 5, 5011},{4, 3, 5012},{8, 2, 5024},{12, 3, 5024},{16, 3, 5024},{20, 5, 5041}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5022},{4, 3, 5024},{8, 3, 5042},{12, 3, 5024},{16, 2, 5022}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5041},{4, 2, 5024},{8, 2, 5024},{12, 2, 5022},{13, 2, 5032},{16, 2, 5034}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5022},{6, 3, 5041},{12, 3, 5024},{18, 1, 5052},{24, 2, 5042}}}
    },

    [15] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5005},{4, 3, 5005},{8, 4, 5005},{12, 5, 5005}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5014},{4, 3, 5014},{8, 4, 5014},{12, 5, 5014}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5034},{4, 3, 5034},{8, 4, 5034},{12, 5, 5034}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5043},{4, 3, 5043},{8, 4, 5043},{12, 5, 5043}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5074},{4, 3, 5074},{8, 4, 5074},{12, 5, 5074}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5005},{4, 3, 5014},{8, 3, 5034},{12, 3, 5043},{16, 3, 5074},{20, 3, 5074},{24, 3, 5005},{25, 3, 5014},{26, 3, 5034},{27, 3, 5043},{28, 3, 5074}}},
    },

    [16] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5006},{4, 4, 5006},{8, 5, 5006},{12, 6, 5006}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5015},{4, 4, 5015},{8, 5, 5015},{12, 6, 5015}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5035},{4, 4, 5035},{8, 5, 5035},{12, 6, 5035}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5044},{4, 4, 5044},{8, 5, 5044},{12, 6, 5044}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5075},{4, 4, 5075},{8, 5, 5075},{12, 6, 5075}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5006},{4, 4, 5015},{8, 4, 5035},{12, 4, 5044},{16, 4, 5044},{20, 4, 5075},{24, 4, 5006},{25, 4, 5015},{26, 4, 5035},{27, 4, 5044},{28, 4, 5075}}},
    },

    [17] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 5, 5006},{4, 3, 5012},{8, 2, 5024},{12, 3, 5024},{16, 3, 5024},{20, 5, 5041}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5015},{4, 3, 5024},{8, 3, 5042},{12, 3, 5024},{16, 2, 5022}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5035},{4, 2, 5024},{8, 2, 5024},{12, 2, 5022},{13, 2, 5032},{16, 2, 5034}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5022},{2, 3, 5006},{5, 3, 5041},{8, 3, 5015},{11, 3, 5024},{14, 3, 5035},{17, 1, 5052},{20, 3, 5044},{23, 4, 5008}, {23, 2, 5042},{26, 3, 5075}}}
    },

    [18] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 5, 5006},{4, 3, 5012},{8, 3, 5024},{12, 4, 5024},{16, 3, 5024},{20, 5, 5041}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5015},{4, 3, 5024},{8, 5, 5042},{12, 3, 5024},{16, 3, 5022}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5035},{4, 2, 5024},{8, 2, 5024},{12, 2, 5022},{13, 3, 5032},{16, 6, 5071},{19, 2, 5034}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5022},{2, 3, 5006},{5, 3, 5041},{8, 3, 5015},{11, 4, 5024},{14, 3, 5035},{17, 2, 5052},{18, 6, 5071},{20, 3, 5044},{23, 2, 5042},{26, 3, 5008},{26, 3, 5017}, {26, 3, 5075},{27, 2, 5062}}}
    },

    [19] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5037},{4, 2, 5035},{8, 2, 5045},{12, 2, 5044},{16, 2, 5054},{20, 2, 5053}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5037},{4, 3, 5035},{8, 2, 5045},{12, 3, 5044},{16, 2, 5054},{20, 3, 5053}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5054},{4, 3, 5056},{8, 3, 5045},{12, 3, 5046},{16, 3, 5037},{20, 3, 5036}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5062},{4, 10, 5073},{8, 4, 5062},{12, 15, 5073}}}
    },

    [20] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5037},{4, 3, 5035},{8, 2, 5045},{12, 3, 5044},{16, 2, 5054},{20, 3, 5053}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5037},{4, 3, 5035},{8, 3, 5045},{12, 3, 5044},{16, 3, 5054},{20, 3, 5053}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5054},{4, 3, 5056},{8, 3, 5045},{12, 3, 5046},{16, 3, 5037},{20, 3, 5036}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 5, 5062},{4, 12, 5073},{8, 5, 5062},{12, 17, 5073}}}
    },

    --变小
    [21] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5007},{0.5, 2, 5016},{4, 2, 5006},{4, 2, 5015},{8, 2, 5026},{8, 2, 5037},{12, 2, 5025},{12, 2, 5035},{16, 2, 5045},{16, 2, 5054},{20, 2, 5044},{20, 2, 5054},{24, 2, 5062},{24, 2, 5061}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5007},{0.5, 2, 5016},{4, 3, 5006},{4, 3, 5015},{8, 2, 5026},{8, 2, 5037},{12, 3, 5025},{12, 3, 5035},{16, 2, 5045},{16, 2, 5054},{20, 3, 5044},{20, 3, 5054},{24, 2, 5062},{24, 3, 5061}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5007},{0.5, 3, 5016},{4, 3, 5006},{4, 3, 5015},{8, 3, 5026},{8, 3, 5037},{12, 4, 5025},{12, 3, 5035},{16, 3, 5045},{16, 3, 5054},{20, 3, 5044},{20, 3, 5054},{24, 3, 5062},{24, 4, 5061},{26, 10, 5073}}},
    },

    --闪烁
    [22] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5007},{0.5, 2, 5016},{4, 2, 5008},{4, 2, 5017},{8, 2, 5026},{8, 2, 5037},{12, 2, 5027},{12, 2, 5038},{16, 2, 5045},{16, 2, 5054},{20, 2, 5046},{20, 2, 5056},{24, 2, 5062},{24, 2, 5063}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5007},{0.5, 2, 5016},{4, 3, 5008},{4, 3, 5017},{8, 2, 5026},{8, 2, 5037},{12, 3, 5027},{12, 3, 5038},{16, 2, 5045},{16, 2, 5054},{20, 3, 5046},{20, 3, 5056},{24, 2, 5062},{24, 3, 5063}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5007},{0.5, 3, 5016},{4, 3, 5008},{4, 3, 5017},{8, 3, 5026},{8, 3, 5037},{12, 3, 5027},{12, 3, 5038},{16, 3, 5045},{16, 2, 5054},{20, 3, 5046},{20, 3, 5056},{24, 3, 5062},{24, 3, 5063},{26, 10, 5073}}},
    },

    --闪烁和变小
    [23] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5035},{4, 2, 5024},{8, 2, 5024},{12, 2, 5022},{13, 3, 5032},{16, 6, 5071},{19, 2, 5034}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5054},{4, 4, 5056},{8, 4, 5045},{12, 4, 5046},{16, 4, 5037},{20, 6, 5036}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5007},{0.5, 2, 5016},{4, 3, 5006},{4, 3, 5015},{8, 2, 5026},{8, 2, 5037},{12, 3, 5025},{12, 2, 5035},{16, 1, 5045},{16, 1, 5054},{20, 1, 5044},{20, 2, 5054},{24, 1, 5062},{24, 3, 5061},{26, 10, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 2, 5007},{0.5, 2, 5016},{4, 3, 5008},{4, 3, 5017},{8, 2, 5026},{8, 2, 5037},{12, 3, 5027},{12, 2, 5038},{16, 2, 5045},{16, 2, 5054},{20, 2, 5046},{20, 2, 5056},{24, 2, 5062},{24, 3, 5063}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5007},{0.5, 3, 5016},{4, 3, 5006},{4, 3, 5017},{8, 3, 5026},{8, 3, 5037},{12, 3, 5025},{12, 3, 5038},{16, 2, 5045},{16, 3, 5054},{20, 2, 5044},{20, 3, 5056},{24, 3, 5062},{24, 3, 5061},{26, 10, 5073}}},
    },

    --总结
    [24] = {
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5001},{3, 3, 5001},{8, 2, 5001},{13, 4, 5001},{19, 2, 5003}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5001},{4, 4, 5011},{8, 1, 5003},{12, 3, 5011},{17, 3, 5003}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 5, 5001},{4, 5, 5011},{8, 2, 5003},{12, 5, 5011},{20, 3, 5012},{24, 5, 5011},{28, 3, 5012}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5001},{3, 2, 5073},{7, 3, 5001},{11, 2, 5021},{15, 2, 5073},{19, 4, 5022}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 4, 5022},{3, 10, 5073},{8, 5, 5021},{7, 10, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 10, 5004},{6, 10, 5013},{12, 10, 5023},{18, 10, 5033},{24, 20, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5022},{6, 3, 5024},{12, 3, 5024},{18, 1, 5052},{24, 2, 5034},{16, 4, 5024}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5005},{4, 3, 5014},{8, 3, 5034},{12, 3, 5043},{16, 3, 5074},{20, 3, 5074},{24, 3, 5005},{25, 3, 5014},{26, 3, 5034},{27, 3, 5043},{28, 3, 5074}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5022},{2, 3, 5006},{5, 3, 5041},{8, 3, 5015},{11, 3, 5024},{14, 3, 5035},{17, 1, 5052},{20, 3, 5044},{23, 2, 5042},{26, 3, 5075}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 6, 5062},{6, 15, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5007},{0.5, 3, 5016},{4, 4, 5006},{4, 4, 5015},{8, 3, 5026},{8, 3, 5037},{12, 4, 5025},{12, 4, 5035},{16, 3, 5045},{16, 3, 5054},{20, 4, 5044},{20, 4, 5054},{24, 3, 5062},{24, 5, 5061},{26, 10, 5073}}},
        {["delay"] = 2 , ["monsterList"]={{0.5, 3, 5007},{0.5, 3, 5016},{4, 4, 5006},{4, 4, 5017},{8, 3, 5026},{8, 3, 5037},{12, 4, 5025},{12, 4, 5038},{16, 3, 5045},{16, 3, 5054},{20, 4, 5044},{20, 4, 5056},{24, 3, 5062},{24, 5, 5061},{26, 10, 5073}}},
    },
}
                              --5052

--放大招啦，试试单击英雄 ^_^：Click the role,try the most powerful weapon.
--别怕它，双击英雄切换近战~：Don't be afraid! double-click the role to switch to close attacking.
--双击英雄切换为远程吧^_^:Double-click the role to switch to remote attacking.
--[[
guide = {
    [1] = {["describe"] = "Click on the role,and try the superpower.",},
    [2] = {["describe"] = "Don't be afraid,double-click the role to switch to close attack.",},
    [3] = {["describe"] = "Double-click the role to switch to remote attack",},
}
]]
guide = {
    [1] = {["describe"] = "放大招啦，试试单击英雄^_^.",},
    [2] = {["describe"] = "别怕它，双击英雄切换近战~.",},
    [3] = {["describe"] = "双击英雄切换为远程吧^_^.",},
}

--[[
buy_hero = {
    [2] = {["describe"] = "Getting 18 stars can help you unlock this role.",},
    [3] = {["describe"] = "Getting 36 stars can help you unlock this role.",},
}]]
buy_hero = {
    [2] = {["describe"] = "获得18颗星或者1000金币.",},
    [3] = {["describe"] = "获得36颗星或者2000金币.",},
}




gift_config = {
    [1] = {[10001] = 5, [10002] = 5, [10003] = 5, [10004] = 5, [10005] = 5, ["gold"] = 2000,["heroId"] = 4,["price"] = 12,
        ["describe"] = "新手大礼包 送5种道具各若干个 金钱若干",},
    [2] = {["gold"] = 10000,["price"] = 10,
        ["describe"] = "金钱大礼包 送金钱若干",},
    [3] = {[10001] = 2, [10002] = 2, [10003] = 2, [10004] = 2, [10005] = 2, ["heroId"] = 4,["price"] = 9,
        ["describe"] = "英雄大礼包 送英雄",},
    [4] = {[10001] = 3, [10002] = 3, [10003] = 3, [10004] = 3, [10005] = 3, ["heroId"] = 4,["price"] = 10,
        ["describe"] = "充值大礼包 送英雄和道具若干",},
    [5] = {[10001] = 9, [10002] = 9, [10003] = 9, [10004] = 9, [10005] = 9, ["gold"] = 2000,["price"] = 10,
        ["describe"] = "道具大礼包 送道具若干 和 金钱若干",},
    [6] = {[10001] = 2, [10002] = 2, [10003] = 2, [10004] = 2, [10005] = 2, ["heroId"] = 5,["price"] = 10,
        ["describe"] = "充值大礼包 送英雄和道具若干",},
    [7] = {[10001] = 2, [10002] = 2, [10003] = 2, [10004] = 2, [10005] = 2, ["heroId"] = 2,["price"] = 7,
        ["describe"] = "充值大礼包 送英雄和道具若干",},
    [8] = {[10001] = 2, [10002] = 2, [10003] = 2, [10004] = 2, [10005] = 2, ["heroId"] = 3,["price"] = 8,
        ["describe"] = "充值大礼包 送英雄和道具若干",},
	[9] = {["price"] = 1, ["describe"] = "是否立即复活"}
}



gift_config_sec = {
    [1] = {[10001] = 15, [10002] = 15, [10003] = 10, ["gold"] = 10000,
        ["describe"] = "新手大礼包 送道具各若干个 金钱若干",["price"] = 20},
    [2] = {["gold"] = 5000,["heroId"] = 5,
        ["describe"] = "解锁第五个英雄 金钱5000",["price"] = 15},
    [3] = {["gold"] = 3000,["heroId"] = 4,
        ["describe"] = "解锁第四个英雄 金钱3000",["price"] = 12},
    [4] = {["gold"] = 2000,["heroId"] = 3,
        ["describe"] = "解锁第三个英雄 金钱2000",["price"] = 10},
    [5] = {["gold"] = 500,["heroId"] = 2,
        ["describe"] = "解锁第二个英雄 金钱500",["price"] = 8},
    [6] = {["gold"] = 5000,
        ["describe"] = "获得金钱500",["price"] = 5},
    [7] = {["prop"] = 1,["count"] = 15,[10001] = 15,
        ["describe"] = "获得道具1 15个",["price"] = 6},
    [8] = {["prop"] = 2,["count"] = 12,[10002] = 12,
        ["describe"] = "获得道具2 12个",["price"] = 6},
    [9] = {["prop"] = 3,["count"] = 8,[10003] = 8,
        ["describe"] = "获得道具3 8个", ["price"] = 4},
    [10] = {["prop"] = 3,["count"] = 8,
        ["describe"] = "是否立即复活", ["price"] = 2},
}




